'''Найдите сумму цифр трехзначного числа.
*Пример:*
123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0)'''

int_num = int(input('Введите трехзначное число: '))
sum_num = ((int_num // 100) + (int_num // 10 % 10) + (int_num % 10) )
print(int_num, '->', sum_num, "(", int_num // 100, "+", int_num // 10 % 10, "+", int_num % 10, ")")





